//F2403SRT JOB 'SORT1 ',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,02)
//STEP001  EXEC PGM=SORT
//SORTIN   DD   *
0001CACA
0002YURI
0004BASTOS
0003WESLEY
//SORTOUT  DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
 SORT FIELDS=(01,04,CH,A)
