//F2403E13 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
//STEP001  EXEC PGM=F2403P13,PARM='008012'
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//ARQVSAM  DD DSN=GR.F2403.ARQVSAM,DISP=SHR
