//F2403E10 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
//STEP001  EXEC PGM=F2403P10
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//ARQVSAM  DD DSN=GR.F2403.ARQVSAM,DISP=SHR
//SYSIN    DD *
016CARLOS DINIZ        CARD@GMAIL.COM      NETFLIX   049900
