//F2403E03 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,02)
//STEP001  EXEC PGM=F2403P03
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//ASSINAS  DD DSN=GR.F2403.ASSINA,DISP=SHR
//LOGERROS DD DSN=GR.F2403.LOGERROS,DISP=SHR
