//F2403E14 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
//STEP001  EXEC PGM=F2403P14
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//ARQVSAM  DD DSN=GR.F2403.ARQVSAM,DISP=SHR
//LOGERROS DD DSN=GR.F2403.LOGERROS,DISP=SHR
//SYSIN    DD *
G
033ROSICLAIR SANTOS    ROSCLA@OUTLOOK.COM  PRIME     0A990
