//F2403SRT JOB 'SORT02',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,02)
//STEP001  EXEC PGM=SORT
//SORTIN   DD   DSN=GR.F2400.ASSINA,DISP=SHR
//SORTOUT  DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
 SORT FIELDS=(01,03,CH,A)
