//F2403SRT JOB 'SORT04 ',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,02)
//STEP001  EXEC PGM=SORT
//SORTIN   DD   DSN=GR.F2403.ASSINA,DISP=SHR
//SORTOUT  DD   DSN=GR.F2403.ASSINA,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
 SORT FIELDS=(01,03,CH,A)
